blog/2023/05/notebooks/index.org
#+TITLE: Portable, Repeatable (, and Reproducible) Notebooks
#+TAGS: notebooks
#+TAGS: emacs
#+TAGS: org-mode
#+TAGS: babel
#+TAGS: SLURM
#+TAGS: Reproduciable Research
#+TAGS: Experiments
#+DATE: 2023-05-31
#+SLUG: portable-repeatable-reproducible-notebooks
#+LINK: org-mode https://orgmode.org/
#+LINK: jupyter https://jupyter.org/
#+LINK: livebook https://livebook.dev/
#+LINK: sagemath https://www.sagemath.org/
#+LINK: r-markdown https://rmarkdown.rstudio.com/
#+LINK: pweave https://mpastell.com/pweave/
#+LINK: git https://git-scm.com/
#+LINK: emacs https://www.gnu.org/software/emacs/
#+LINK: org-babel https://orgmode.org/worg/org-contrib/babel/
#+LINK: slurm https://slurm.schedmd.com/
#+LINK: guix https://guix.gnu.org/
#+LINK: envrc https://github.com/purcell/envrc
#+LINK: direnv https://direnv.net/
#+LINK: relocatable-packs https://hpc.guix.info/blog/2020/05/faster-relocatable-packs-with-fakechroot/
#+LINK: elisp https://www.gnu.org/software/emacs/manual/elisp.html
#+LINK: parallel https://www.gnu.org/software/parallel/
#+LINK: slurm-job-arrays https://slurm.schedmd.com/job_array.html
#+LINK: joel-grus-idontlikenotebooks https://docs.google.com/presentation/d/1n2RlMdmv1p25Xy5thJUhkKGvjtV-dkAIsUXP-AL4ffI/edit#slide=id.g362da58057_0_1
#+LINK: org-mode-meta-language https://orgmode.org/worg/org-contrib/babel/intro.html#meta-programming-language

#+BEGIN_PREVIEW
Notebooks represent an important improvement for interactive and iterative
research.  However, they tend to lack portability, reproducibility, and
repeatability.  In this post, I want to explore the iterations of using [[org-mode][Org
mode]] notebooks combined with other tools to develop a (hopefully) portable,
reproducible, and repeatable notebook for software engineering experiments.
While the focus remains narrowed to software engineering, the tools and
techniques described should be applicable to any study requiring these
properties.
#+END_PREVIEW

By using a number of techniques, it is easy to create notebooks which can be
passed along to collaborators, referees, and our future selves.  Importantly,
this post is *NOT* an introduction to [[org-mode][Org Mode]], [[org-babel][Org Babel]], or notebooks in
general.  The main contributions of this post is a series of techniques for [[org-mode][Org
mode]] to make the documents easily portable and repeatable with minimal fuss.

** Background
:PROPERTIES:
:ID:       fb50dea6-e7d5-45e0-bceb-6d845a08f1b9
:END:

There exists numerous examples of different "notebook" implementations, such as
[[jupyter][Jupyter Notebooks]], [[sagemath][SageMath Worksheets]], [[r-markdown][R Markdown]] and [[livebook][Elixir Livebook]]; and
some less traditional ones, such as [[org-mode][Org Mode]] and tools such as [[pweave][Pweave]].

*** Notebooks
:PROPERTIES:
:ID:       8b5ceabd-ae73-466d-b909-dae18c0a5cd0
:END:

[[jupyter][Jupyter Notebooks]] is arguably the most common and prevalent notebook system out
there, with many features.  It supports many features such as different
"kernels" to execute different languages, integrated documentation and code,
and inline plotting.  However, the underlying format is cumbersome and
difficult to use in collaboration with other developers using traditional tools
such as [[git][Git]].  For a larger list of issues with notebooks in general, see the
Caveats section below.

*** Org-Mode (+ Emacs)
:PROPERTIES:
:ID:       de6fed7b-4239-44c9-b7cf-2c8f5d6a8b9d
:END:

As an alternative, [[org-mode][Org Mode]] (with [[emacs][Emacs]]) offers all the desired features of
notebooks, but similarly gets around some of the limitations typical notebook
implementations impose.  For example, the notebook is manipulated directly in
your editor of choice(™); all creature comforts included.  Moreover, [[org-babel][Org Babel]]
offers the expected seamless integration between documentation and code blocks
and more.  For example, the code blocks within a notebook can be "tangled" out
and executed in a more typical command-line driven style.  Multi-kernel
notebooks are not common outside of a few extensions, such a feature is built
directly into [[org-mode][Org Mode's]] operation.  Moreover, computations from one snippet
can be input to another, in a different language.  For example, see the [[org-mode-meta-language][Meta
Programming Language]] documentation.

** Caveats
:PROPERTIES:
:ID:       2779b02a-f896-4466-bfd0-da200ddb9767
:END:

Notebooks are susceptible to a [[joel-grus-idontlikenotebooks][number of issues]] and [[org-mode][Org mode]] notebooks are no
exception.  These issues are not specifically addressed in this post, but they
absolutely require attention and acknowledgment.  Notably, state management and
"execution flow" are not straightforward concepts within notebooks since
developers can execute snippets in any order.

While not the standard way of interacting with notebooks, [[org-mode][Org mode]] provides a
mechanism for specifying code snippet/block dependency.  Its usage, however, is
restricted to when one block explicitly depends on the computational result of
another.  Specifically, using named variables to pass data between source
blocks imposes a computation dependency.  In this way, out of order execution
problems are alleviated, making the notebook easier to comprehend, even if the
format is not top-down.

** Candidate Solution
:PROPERTIES:
:ID:       b093c1ad-e5ac-4a99-ae8b-b163f5319125
:END:

The following is /a/ candidate solution to this problem.  It can and should be
refined, but it represents a decent step in the right direction.  First, we
discuss the "reproducible" component.  Then using an example, we discuss
portability and repeatability together.

*** Reproducible
:PROPERTIES:
:ID:       2ba8f998-2a0c-4c7e-bfd0-7ea7fd6615fb
:END:

[[guix][GNU Guix]] provides the necessary reproducibility.  Specifically, using [[envrc][envrc]] and
[[direnv][direnv]], a manifest is loaded and shimmed into the current environment within
[[emacs][Emacs]].  In this way, [[emacs][Emacs]] and other shell processes are using a specific
environment which includes the necessary tools and libraries for the project.
The same manifest is used to create a [[relocatable-packs]["really reproducible"]] package/archive
which is deployed to an HPC cluster.  This is all done using a channels file to
version pin the entire dependency tree (down to the C compiler and GLibC).

