blog/2023/05/notebooks/index.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2023-07-06 Thu 08:58 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Portable, Repeatable (, and Reproducible) Notebooks</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="kb" />
<meta charset="utf-8">

<meta name="author" content="Kenny Ballou">
<meta name="viewport" content="width=device-width, initial-scale=1, maximum-scale=1">

<title>~kb</title>

<link rel="canonical" href="/" />
<link href="/index.xml" rel="alternate" type="application/rss+xml"
      title="~kb/blog" />

<link rel="stylesheet" href="/css/simple.css" />
<link rel="stylesheet" href="/css/simple.add.css" />
<link rel="stylesheet" href="/css/katex.css" />
<link rel="stylesheet" href="/css/fa-all.css" />
<link rel="shortcut icon" href="/favicon.ico" type="image/x-icon" />
</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href="https://kennyballou.com/blog"> UP </a>
 |
 <a accesskey="H" href="https://kennyballou.com/"> HOME </a>
</div><header id="" class="status">
<nav>
  <a href="/">
    <i class="fade fas fa-home"></i>
  </a>
  <a href="/about.html">
    <i class="fade fas fa-user-circle"></i>
  </a>
  <a href="https://git.sr.ht/~kennyballou/"
     target="_blank"
     rel="noopener noreferrer">
    <i class="fade fas fa-code-branch fa-1x"></i>
  </a>
  <a href="https://github.com/kennyballou"
     target="_blank"
     rel="noopener noreferrer">
    <i class="fade fab fa-github fa-1x"></i>
  </a>
  <a href="https://bitbucket.org/kballou"
     target="_blank"
     rel="noopener noreferrer">
    <i class="fade fab fa-bitbucket fa-1x"></i>
  </a>
  <a href="https://linkedin.com/in/kennyballou"
     target="_blank"
     rel="noopener noreferrer">
    <i class="fade fab fa-linkedin-in fa-1x"></i>
  </a>
  <a href="/support.html">
    <i class="fade fas fa-heart fa-1x"></i>
  </a>
  <a href="/resume.pdf"
     target="_blank">
    <i class="fade far fa-file-pdf"></i>
  </a>
  <a href="/B74CC4B41148C3DB364BC21182D94B35744E1B34.asc"
     target="_blank">
    <i class="fade fas fa-key"></i>
  </a>
  <a href="/index.xml" rel="alternate"
     type="application/rss+xml">
    <i class="fade fas fa-rss fa-1x"></i>
  </a>
</nav>
</header>
<div id="main">
<h1 class="title">Portable, Repeatable (, and Reproducible) Notebooks</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orgba272e8">Background</a>
<ul>
<li><a href="#org6a60922">Notebooks</a></li>
<li><a href="#org4af6b5d">Org-Mode (+ Emacs)</a></li>
</ul>
</li>
<li><a href="#org81e3c29">Caveats</a></li>
<li><a href="#orgd0d0607">Candidate Solution</a>
<ul>
<li><a href="#orgc68db55">Reproducible</a></li>
<li><a href="#orgffc3d50">Portable and Repeatable</a></li>
</ul>
</li>
<li><a href="#org69f6b2f">Discussion</a></li>
</ul>
</div>
</div>
<div class="PREVIEW">
<p>
Notebooks represent an important improvement for interactive and iterative
research.  However, they tend to lack portability, reproducibility, and
repeatability.  In this post, I want to explore the iterations of using <a href="https://orgmode.org/">Org
mode</a> notebooks combined with other tools to develop a (hopefully) portable,
reproducible, and repeatable notebook for software engineering experiments.
While the focus remains narrowed to software engineering, the tools and
techniques described should be applicable to any study requiring these
properties.
</p>

</div>

<p>
By using a number of techniques, it is easy to create notebooks which can be
passed along to collaborators, referees, and our future selves.  Importantly,
this post is <b>NOT</b> an introduction to <a href="https://orgmode.org/">Org Mode</a>, <a href="https://orgmode.org/worg/org-contrib/babel/">Org Babel</a>, or notebooks in
general.  The main contributions of this post is a series of techniques for <a href="https://orgmode.org/">Org
mode</a> to make the documents easily portable and repeatable with minimal fuss.
</p>

<div id="outline-container-orgba272e8" class="outline-2">
<h2 id="orgba272e8">Background</h2>
<div class="outline-text-2" id="text-orgba272e8">
<p>
There exists numerous examples of different "notebook" implementations, such as
<a href="https://jupyter.org/">Jupyter Notebooks</a>, <a href="https://www.sagemath.org/">SageMath Worksheets</a>, <a href="https://rmarkdown.rstudio.com/">R Markdown</a> and <a href="https://livebook.dev/">Elixir Livebook</a>; and
some less traditional ones, such as <a href="https://orgmode.org/">Org Mode</a> and tools such as <a href="https://mpastell.com/pweave/">Pweave</a>.
</p>
</div>

<div id="outline-container-org6a60922" class="outline-3">
<h3 id="org6a60922">Notebooks</h3>
<div class="outline-text-3" id="text-org6a60922">
<p>
<a href="https://jupyter.org/">Jupyter Notebooks</a> is arguably the most common and prevalent notebook system out
there, with many features.  It supports many features such as different
"kernels" to execute different languages, integrated documentation and code,
and inline plotting.  However, the underlying format is cumbersome and
difficult to use in collaboration with other developers using traditional tools
such as <a href="https://git-scm.com/">Git</a>.  For a larger list of issues with notebooks in general, see the
Caveats section below.
</p>
</div>
</div>

<div id="outline-container-org4af6b5d" class="outline-3">
<h3 id="org4af6b5d">Org-Mode (+ Emacs)</h3>
<div class="outline-text-3" id="text-org4af6b5d">
<p>
As an alternative, <a href="https://orgmode.org/">Org Mode</a> (with <a href="https://www.gnu.org/software/emacs/">Emacs</a>) offers all the desired features of
notebooks, but similarly gets around some of the limitations typical notebook
implementations impose.  For example, the notebook is manipulated directly in
your editor of choice(™); all creature comforts included.  Moreover, <a href="https://orgmode.org/worg/org-contrib/babel/">Org Babel</a>
offers the expected seamless integration between documentation and code blocks
and more.  For example, the code blocks within a notebook can be "tangled" out
and executed in a more typical command-line driven style.  Multi-kernel
notebooks are not common outside of a few extensions, such a feature is built
directly into <a href="https://orgmode.org/">Org Mode's</a> operation.  Moreover, computations from one snippet
can be input to another, in a different language.  For example, see the <a href="https://orgmode.org/worg/org-contrib/babel/intro.html#meta-programming-language">Meta
Programming Language</a> documentation.
</p>
</div>
</div>
</div>

<div id="outline-container-org81e3c29" class="outline-2">
<h2 id="org81e3c29">Caveats</h2>
<div class="outline-text-2" id="text-org81e3c29">
<p>
Notebooks are susceptible to a <a href="https://docs.google.com/presentation/d/1n2RlMdmv1p25Xy5thJUhkKGvjtV-dkAIsUXP-AL4ffI/edit#slide=id.g362da58057_0_1">number of issues</a> and <a href="https://orgmode.org/">Org mode</a> notebooks are no
exception.  These issues are not specifically addressed in this post, but they
absolutely require attention and acknowledgment.  Notably, state management and
"execution flow" are not straightforward concepts within notebooks since
developers can execute snippets in any order.
</p>

<p>
While not the standard way of interacting with notebooks, <a href="https://orgmode.org/">Org mode</a> provides a
mechanism for specifying code snippet/block dependency.  Its usage, however, is
restricted to when one block explicitly depends on the computational result of
another.  Specifically, using named variables to pass data between source
blocks imposes a computation dependency.  In this way, out of order execution
problems are alleviated, making the notebook easier to comprehend, even if the
format is not top-down.
</p>
</div>
</div>

<div id="outline-container-orgd0d0607" class="outline-2">
<h2 id="orgd0d0607">Candidate Solution</h2>
<div class="outline-text-2" id="text-orgd0d0607">
<p>
The following is <i>a</i> candidate solution to this problem.  It can and should be
refined, but it represents a decent step in the right direction.  First, we
discuss the "reproducible" component.  Then using an example, we discuss
portability and repeatability together.
</p>
</div>

<div id="outline-container-orgc68db55" class="outline-3">
<h3 id="orgc68db55">Reproducible</h3>
<div class="outline-text-3" id="text-orgc68db55">
<p>
<a href="https://guix.gnu.org/">GNU Guix</a> provides the necessary reproducibility.  Specifically, using <a href="https://github.com/purcell/envrc">envrc</a> and
<a href="https://direnv.net/">direnv</a>, a manifest is loaded and shimmed into the current environment within
<a href="https://www.gnu.org/software/emacs/">Emacs</a>.  In this way, <a href="https://www.gnu.org/software/emacs/">Emacs</a> and other shell processes are using a specific
environment which includes the necessary tools and libraries for the project.
The same manifest is used to create a <a href="https://hpc.guix.info/blog/2020/05/faster-relocatable-packs-with-fakechroot/">"really reproducible"</a> package/archive
which is deployed to an HPC cluster.  This is all done using a channels file to
version pin the entire dependency tree (down to the C compiler and GLibC).
</p>
</div>
</div>
