blog/2023/05/notebooks/index.html

<div id="outline-container-orgffc3d50" class="outline-3">
<h3 id="orgffc3d50">Portable and Repeatable</h3>
<div class="outline-text-3" id="text-orgffc3d50">
<p>
For a recent conference paper, I needed to repeatedly run a few thousand
different experiments and then the aggregation and analysis of those
experiments.  This was accomplished with an <a href="https://orgmode.org/">Org mode</a> notebook.  The major
techniques discovered in the process are accessible properties, named example
blocks, and liberal use of header arguments.
</p>

<p>
The following are series of exerts directly from the notebook highlighting each
of these features.
</p>

<p>
The file was structured into several different headings, each for different
parts of the process.  The heading of the notebook had a few variables which
are used throughout the notebook:
</p>

<div class="org-src-container">
<pre class="src src-org"><span style="font-weight: bold;">* notebook</span>
<span style="font-weight: bold;">:PROPERTIES:</span>
<span style="font-weight: bold;">:REMOTE:</span> borah.boisestate.edu
<span style="font-weight: bold;">:REMOTE-DIR:</span> /bsuhome/kennyballou/scratch
<span style="font-weight: bold;">:END:</span>
</pre>
</div>

<p>
Everything that interacts with the HPC cluster is then relative to these two
variables.  Another user can change these two variables and easily execute the
notebook.  For example, the following is a batch script which is "tangled" to
the HPC cluster.  Notice, the <code>:tangle</code> property uses these variables:
</p>

<div class="org-src-container">
<pre class="src src-org"><span style="font-weight: bold; font-style: italic;">#+begin_src bash :tangle (concat "/ssh:" (org-entry-get nil "REMOTE" t) ":" (org-entry-get nil "REMOTE-DIR" t) "/run-intervals-analysis.sh")</span>
<span style="font-weight: bold; font-style: italic;">#</span><span style="font-weight: bold; font-style: italic;">!/usr/bin/env bash</span>

<span style="font-weight: bold; font-style: italic;">#</span><span style="font-weight: bold; font-style: italic;">SBATCH -N 1</span>
<span style="font-weight: bold; font-style: italic;">#</span><span style="font-weight: bold; font-style: italic;">SBATCH -n 1</span>
<span style="font-weight: bold; font-style: italic;">#</span><span style="font-weight: bold; font-style: italic;">SBATCH -c 4</span>
<span style="font-weight: bold; font-style: italic;">#</span><span style="font-weight: bold; font-style: italic;">SBATCH --mem=64G</span>
<span style="font-weight: bold; font-style: italic;">#</span><span style="font-weight: bold; font-style: italic;">SBATCH -t 0-03:00:00</span>
<span style="font-weight: bold; font-style: italic;">#</span><span style="font-weight: bold; font-style: italic;">SBATCH -p bsudfq</span>

module purge

<span style="font-weight: bold; font-style: italic;">RESULTS_PATH</span>=${<span style="font-weight: bold; font-style: italic;">1</span>}
<span style="font-weight: bold; font-style: italic;">CLASS_NAME</span>=${<span style="font-weight: bold; font-style: italic;">2</span>}
<span style="font-weight: bold; font-style: italic;">METHOD_ID</span>=${<span style="font-weight: bold; font-style: italic;">3</span>}

<span style="font-weight: bold;">exec</span> ~/DFA/bin/dfa interval-numerical <span style="font-style: italic;">\</span>
     --classpath ~/DFA/artifacts.jar <span style="font-style: italic;">\</span>
     --output <span style="font-style: italic;">"${RESULTS_PATH}"</span> <span style="font-style: italic;">\</span>
     <span style="font-style: italic;">"${CLASS_NAME}"</span> <span style="font-style: italic;">\</span>
     <span style="font-style: italic;">"${METHOD_ID}"</span>
<span style="font-weight: bold; font-style: italic;">#+end_src</span>
</pre>
</div>

<p>
Relative to the current notebook, we also have data files.  Many code blocks
need to refer to these data files throughout the experimental process.  To
accomplish this, they are named using example blocks:
</p>

<div class="org-src-container">
<pre class="src src-org"><span style="font-weight: bold; font-style: italic;">#+NAME: METHODS</span>
<span style="font-weight: bold; font-style: italic;">#+begin_example</span>
./in/methods.txt
<span style="font-weight: bold; font-style: italic;">#+end_example</span>

<span style="font-weight: bold; font-style: italic;">#+NAME: DOMAINS</span>
<span style="font-weight: bold; font-style: italic;">#+begin_example</span>
./in/domains.txt
<span style="font-weight: bold; font-style: italic;">#+end_example</span>

<span style="font-weight: bold; font-style: italic;">#+NAME: COMPARISONS</span>
<span style="font-weight: bold; font-style: italic;">#+begin_example</span>
./in/comparisons.txt
<span style="font-weight: bold; font-style: italic;">#+end_example</span>

<span style="font-weight: bold; font-style: italic;">#+NAME: REPORTS</span>
<span style="font-weight: bold; font-style: italic;">#+begin_example</span>
./in/reports.txt
<span style="font-weight: bold; font-style: italic;">#+end_example</span>
</pre>
</div>

<blockquote>
<p>
To take this a step further, the contents of the files themselves could be
included in the notebook directly and tangled out to the named paths.
</p>
</blockquote>

<p>
Finally, to uniquely identify different experiment runs, the following variable
is generated for each invocation:
</p>

<div class="org-src-container">
<pre class="src src-org"><span style="font-weight: bold; font-style: italic;">#+begin_src bash :eval query</span>
<span style="font-weight: bold;">echo</span> <span style="font-style: italic;">"#+NAME: UUID"</span>
<span style="font-weight: bold;">echo</span> -n $(uuidgen --time)
<span style="font-weight: bold; font-style: italic;">#+end_src</span>

<span style="font-weight: bold; font-style: italic;">#+RESULTS:</span>
<span style="font-weight: bold;">:results:</span>
<span style="font-weight: bold; font-style: italic;">#+NAME: UUID</span>
4cf8581e-e2c2-11ed-aab2-8cf8c5ed93dd
<span style="font-weight: bold;">:end:</span>
</pre>
</div>

<p>
Using this variable, we can create a relative path variable which is referenced
for the experiment and analysis output:
</p>

<div class="org-src-container">
<pre class="src src-org"><span style="font-weight: bold; font-style: italic;">#+NAME: OUTPUT_PREFIX</span>
<span style="font-weight: bold; font-style: italic;">#+begin_src bash :var UUID=(org-sbe UUID) :results silent</span>
<span style="font-weight: bold;">echo</span> -n <span style="font-style: italic;">"./out/${UUID}"</span>
<span style="font-weight: bold; font-style: italic;">#+end_src</span>
</pre>
</div>

<p>
Using a relative path for <code>OUTPUT_PREFIX</code> allows for the prefix to be used on the
remote servers and locally when processed data files are copied to the local
machine for exploratory analysis.
</p>

<p>
The <code>(org-sbe ...)</code> pattern is used frequently because it inherently removes any
newlines that may be introduced either by the literal text or if the variable
is computed from a previous source block.
</p>

<p>
Before jobs are submitted, the remote directory tree needs to be populated:
</p>

<div class="org-src-container">
<pre class="src src-org"><span style="font-weight: bold; font-style: italic;">#+begin_src bash :session *on-borah* :dir (concat "/ssh:" (org-entry-get nil "REMOTE" t) ":" (org-entry-get nil "REMOTE-DIR" t)) :results silent</span>
mkdir -p ${<span style="font-weight: bold; font-style: italic;">OUTPUT_PREFIX</span>}/{joblogs,intervals}
<span style="font-weight: bold; font-style: italic;">#+end_src</span>
</pre>
</div>

<div class="org-src-container">
<pre class="src src-org"><span style="font-weight: bold; font-style: italic;">#+begin_src bash :results silent</span>
scp -q <span style="font-style: italic;">"${METHODS}"</span> ${<span style="font-weight: bold; font-style: italic;">remote</span>}:${<span style="font-weight: bold; font-style: italic;">remote_dir</span>}/${<span style="font-weight: bold; font-style: italic;">OUTPUT_PREFIX</span>}/methods.txt
scp -q <span style="font-style: italic;">"${DOMAINS}"</span> ${<span style="font-weight: bold; font-style: italic;">remote</span>}:${<span style="font-weight: bold; font-style: italic;">remote_dir</span>}/${<span style="font-weight: bold; font-style: italic;">OUTPUT_PREFIX</span>}/domains.txt
scp -q <span style="font-style: italic;">"${COMPARISONS}"</span> ${<span style="font-weight: bold; font-style: italic;">remote</span>}:${<span style="font-weight: bold; font-style: italic;">remote_dir</span>}/${<span style="font-weight: bold; font-style: italic;">OUTPUT_PREFIX</span>}/comparisons.txt
scp -q <span style="font-style: italic;">"${REPORTS}"</span> ${<span style="font-weight: bold; font-style: italic;">remote</span>}:${<span style="font-weight: bold; font-style: italic;">remote_dir</span>}/${<span style="font-weight: bold; font-style: italic;">OUTPUT_PREFIX</span>}/reports.txt
rsync --archive ExperimentData/domains ${<span style="font-weight: bold; font-style: italic;">remote</span>}:${<span style="font-weight: bold; font-style: italic;">remote_dir</span>}/${<span style="font-weight: bold; font-style: italic;">OUTPUT_PREFIX</span>}/.
<span style="font-weight: bold; font-style: italic;">#+end_src</span>
</pre>
</div>

<p>
To keep the source blocks simple and reduce copying, we use <code>header-args</code> to
apply certain variables to all code blocks of a particular section.  For
example, "Job Initialization" has the following header arguments:
</p>

<div class="org-src-container">
<pre class="src src-org"><span style="font-weight: bold; font-style: italic;">**** Job Initialization</span>
<span style="font-weight: bold;">:PROPERTIES:</span>
<span style="font-weight: bold;">:ID:</span>       7e8302d4-38b7-4a3b-aed4-b329c81b43ce
<span style="font-weight: bold;">:header-args:bash:</span> :var OUTPUT_PREFIX=(org-sbe OUTPUT_PREFIX)
<span style="font-weight: bold;">:header-args:bash+:</span> :var METHODS=(org-sbe METHODS)
<span style="font-weight: bold;">:header-args:bash+:</span> :var DOMAINS=(org-sbe DOMAINS)
<span style="font-weight: bold;">:header-args:bash+:</span> :var COMPARISONS=(org-sbe COMPARISONS)
<span style="font-weight: bold;">:header-args:bash+:</span> :var REPORTS=(org-sbe REPORTS)
<span style="font-weight: bold;">:header-args:bash+:</span> :var remote=(org-entry-get nil "REMOTE" t)
<span style="font-weight: bold;">:header-args:bash+:</span> :var remote_dir=(org-entry-get nil "REMOTE-DIR" t)
<span style="font-weight: bold;">:END:</span>
</pre>
</div>

<p>
Finally, to execute a series of analyses, we use <a href="https://www.gnu.org/software/parallel/">GNU Parallel</a> to produce a
cross-product of our input parameters and submit the jobs against the remote machine:
</p>

<div class="org-src-container">
<pre class="src src-org"><span style="font-weight: bold; font-style: italic;">#+name: intervals</span>
<span style="font-weight: bold; font-style: italic;">#+begin_src bash</span>
parallel --colsep <span style="font-style: italic;">'\t'</span> <span style="font-style: italic;">\</span>
         --shuf <span style="font-style: italic;">\</span>
         --jobs=25% <span style="font-style: italic;">\</span>
         --delay 1s <span style="font-style: italic;">\</span>
         ssh -q ${<span style="font-weight: bold; font-style: italic;">remote</span>} <span style="font-style: italic;">\</span>
         sbatch --chdir=<span style="font-style: italic;">"${remote_dir}"</span> <span style="font-style: italic;">\</span>
         --job-name=<span style="font-style: italic;">"intervals-{1}_{2}"</span> <span style="font-style: italic;">\</span>
         --output=<span style="font-style: italic;">"${OUTPUT_PREFIX}/joblogs/%x.out"</span> <span style="font-style: italic;">\</span>
         --error=<span style="font-style: italic;">"${OUTPUT_PREFIX}/joblogs/%x.err"</span> <span style="font-style: italic;">\</span>
         run-intervals-analysis.sh <span style="font-style: italic;">"${OUTPUT_PREFIX}/intervals"</span> <span style="font-style: italic;">"{1}"</span> <span style="font-style: italic;">"{2}"</span> <span style="font-style: italic;">\</span>
         :::: <span style="font-style: italic;">"${METHODS}"</span>
<span style="font-weight: bold; font-style: italic;">#+end_src</span>
</pre>
</div>

<p>
Once the jobs are complete, we can download the results and begin the analysis
process.  However, that is essentially the same set of ideas repeated.
</p>
</div>
</div>
</div>
