blog/2023/05/notebooks/index.org
** Discussion
:PROPERTIES:
:ID:       61ef879d-6fc3-463e-b384-687fdd7c9142
:END:

[[org-mode][Org Mode]] is a huge tool and requires a piecemeal consumption to master.  As
such, many examples using [[org-babel][Org Babel]], for example, do not show the full power of
passing different arguments or using [[elisp][Elisp]] to directly manipulate and pass
variables to different source blocks.  Hopefully, this post can help fill those
gaps of what is possible with a meta-notebook tool like [[org-mode][Org Mode]].

There are some obvious points of improvement.  First, [[guix][Guix]] and [[org-mode][Org Mode]] could
be better integrated such that a single notebook /can/ be entirely
self-contained.  However, projects tend to be more than one file, so this is
not a major limitation.  More importantly, however, the process of submitting
jobs poses several limitations and problems.  [[slurm][SLURM]] is not built for large job
submissions, thus, the delays and limited resources provided to [[parallel][GNU parallel]],
which ultimately tie up [[emacs][Emacs]] for several minutes.  Furthermore, it can be
slightly problematic to have thousands of jobs waiting in SLURM's queue.  A
better approach would be to create [[slurm-job-arrays][Job Arrays]] for each set of experiments.
This would alleviate the pressure on [[slurm][SLURM]] and keep [[emacs][Emacs]] from locking up
during the submission process.  Similarly, it would enable for the process to
be tangled out and sent to the cluster independently of [[emacs][Emacs]].
