blog/2023/05/notebooks/index.html

<div id="outline-container-org69f6b2f" class="outline-2">
<h2 id="org69f6b2f">Discussion</h2>
<div class="outline-text-2" id="text-org69f6b2f">
<p>
<a href="https://orgmode.org/">Org Mode</a> is a huge tool and requires a piecemeal consumption to master.  As
such, many examples using <a href="https://orgmode.org/worg/org-contrib/babel/">Org Babel</a>, for example, do not show the full power of
passing different arguments or using <a href="https://www.gnu.org/software/emacs/manual/elisp.html">Elisp</a> to directly manipulate and pass
variables to different source blocks.  Hopefully, this post can help fill those
gaps of what is possible with a meta-notebook tool like <a href="https://orgmode.org/">Org Mode</a>.
</p>

<p>
There are some obvious points of improvement.  First, <a href="https://guix.gnu.org/">Guix</a> and <a href="https://orgmode.org/">Org Mode</a> could
be better integrated such that a single notebook <i>can</i> be entirely
self-contained.  However, projects tend to be more than one file, so this is
not a major limitation.  More importantly, however, the process of submitting
jobs poses several limitations and problems.  <a href="https://slurm.schedmd.com/">SLURM</a> is not built for large job
submissions, thus, the delays and limited resources provided to <a href="https://www.gnu.org/software/parallel/">GNU parallel</a>,
which ultimately tie up <a href="https://www.gnu.org/software/emacs/">Emacs</a> for several minutes.  Furthermore, it can be
slightly problematic to have thousands of jobs waiting in SLURM's queue.  A
better approach would be to create <a href="https://slurm.schedmd.com/job_array.html">Job Arrays</a> for each set of experiments.
This would alleviate the pressure on <a href="https://slurm.schedmd.com/">SLURM</a> and keep <a href="https://www.gnu.org/software/emacs/">Emacs</a> from locking up
during the submission process.  Similarly, it would enable for the process to
be tangled out and sent to the cluster independently of <a href="https://www.gnu.org/software/emacs/">Emacs</a>.
</p>
</div>
</div>
</div>
<footer id="" class="status">
<footer>
  <p>&copy; 2014-2023 Kenny Ballou.
    <a href="http://creativecommons.org/licenses/by-nc-sa/4.0/">Some rights
      reserved.</a></p>
  <p>Powered by <a href="https://gnu.org">GNU/Linux</a></p>
</footer>
</footer>
</body>
</html>
